# Pandas Date time Index Functionality

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('students_10.csv')
df

         Date  Student ID   Class section   Study hrs  percentag
0  01/07/2009       1001.0     10        A        2.0       60.0
1  02/07/2009       1002.0     10      NaN        NaN       65.0
2  03/07/2009          NaN     11      NaN        6.0       78.0
3  04/07/2009          NaN     12      NaN        7.0        NaN
4  05/07/2009       1005.0     10        C        NaN        NaN
5  06/07/2009          NaN     11        D        NaN       45.0
6  07/07/2009       1007.0     12        A        4.0       76.0
7  08/07/2009       1008.0     10        D        5.0       54.0
8  09/07/2009       1009.0     11        C        4.0       67.0

In [3]:
df.dtypes

Date            object
Student ID     float64
Class            int64
section         object
Study hrs      float64
percentag      float64
dtype: object

In [5]:
type(df.Date[0])

str

In [6]:
df=pd.read_csv('students_10.csv',parse_dates=['Date'])
df

        Date  Student ID   Class section   Study hrs  percentag
0 2009-01-07       1001.0     10        A        2.0       60.0
1 2009-02-07       1002.0     10      NaN        NaN       65.0
2 2009-03-07          NaN     11      NaN        6.0       78.0
3 2009-04-07          NaN     12      NaN        7.0        NaN
4 2009-05-07       1005.0     10        C        NaN        NaN
5 2009-06-07          NaN     11        D        NaN       45.0
6 2009-07-07       1007.0     12        A        4.0       76.0
7 2009-08-07       1008.0     10        D        5.0       54.0
8 2009-09-07       1009.0     11        C        4.0       67.0

In [7]:
df.dtypes

Date           datetime64[ns]
Student ID            float64
Class                   int64
section                object
Study hrs             float64
percentag             float64
dtype: object

In [8]:
type(df.Date[0])

pandas._libs.tslibs.timestamps.Timestamp